{
  "titleNameMap": {
    "educationList": "Education Background",
    "workExpList": "Work Experience",
    "projectList": "Project Experience",
    "skillList": "Skills",
    "awardList": "Additional Information", 
    "workList": "Personal Works",
    "aboutme": "About Me"
  },
  "avatar": {
    "src": "https://avatars.githubusercontent.com/u/15646325?v=4",
    "hidden": true
  },
  "profile": {
    "name": "John Doe",
    "email": "john@email.com",
    "mobile": "123-456-7890",
    "github": "https://github.com/username",
    "workExpYear": "5" 
  },
  "educationList": [
    {
      "edu_time": [ 
        "2013.09.01",
        "2017.06.30"
      ],
      "school": "Zhejiang University of Technology",
      "major": "Digital Media Technology",  
      "academic_degree": "Bachelor's Degree"
    }
  ],
  "awardList": [],
  "workExpList": [
    {
      "company_name": "Shanghai Black Sesame Intelligent Technology",
      "department_name": "CE development",
      "work_time": [
        "2022.08",
        null
      ],
      "work_desc": "Responsible for interfacing with various algorithm groups to provide 2D/3D visualization tools and web-based user UI and debugging tools. Main projects include: user interface and debugging tool development for vehicle-road collaborative projects, development of visualization debugging and preview tools for ADAS vehicle perception projects. Involves technology stacks such as Typescript, WebGL, React, Rust, and Godot engine."
    },
    {
      "company_name": "Shanghai Hesheng Technology",
      "department_name": "Data Visualization Department", 
      "work_time": [
        "2018.06",
        "2022.08"
      ],
      "work_desc": "Developed and maintained the company's data visualization platform based on React, dva, and AntDesign frameworks. Developed various custom visualization projects and components based on native Canvas, pixi.js, Three.js, ArcGis according to customer needs, optimized browser performance of complex visualization pages. Promoted modular distributed development, modularized and integrated module environments. Developed toolchains for special projects (e.g. maps, abstract data relationships) to streamline workflows between development and design, improving efficiency."
    },
    {
      "company_name": "Shanghai Xindong Network Technology",
      "department_name": "",
      "work_time": [
        "2017.06", 
        "2018.04"
      ],
      "work_desc": "Responsible for game logic development of Unity game projects. Cooperated with art designers for various special effects. Participated in developing in-house voice chat framework, implemented OPUS audio migration and secondary development."
    }
  ],
  "skillList": [],
  "projectList": [
    {
      "project_name": "Vehicle-Road Collaborative Edge Computing System",
      "project_role": "GPU Developer",
      "project_time": "Aug 2022 - Present", 
      "project_desc": "Secondary development of vehicle-road collaborative products by combining the company's existing automatic driving and graphics algorithms and technological strengths.",
      "project_content": "1. Developed configurable 3D intersection generator tool based on ThreeJS framework. With minimal input data of intersection coordinates, branch directions, road widths, etc., it can generate a 3D intersection scene containing rich features and automatically convert coordinate system to provide debugging and display platform for algorithms.\n2. Developed edge computing platform backend management interface from scratch based on React framework, including various configurations, camera stream display, and 3D rendering of algorithm results."
    },
    {
      "project_name": "3D Flowchart/Relationship Diagram Editor",
      "project_role": "Lead Developer",
      "project_time": "Apr 2019 - Aug 2021",  
      "project_desc": "ThreeJS-based 3D flowchart editor with various 3D object types that can be dragged and connected. Supports importing custom images/models and configuring object properties to meet display needs. Can be manipulated with mouse or configured precisely through UI to modify styles. Supports scene import/export and file-based saving.",
      "project_content": "Solely responsible for all development work while also adapting it to the company's low-code platform and built-in UI. Optimized line animation effects through shaders, supporting display of 10,000+ simultaneous animated lines. Implemented scene import/export and quick restore based on command pattern logic, making it easier to adapt to other UI frameworks."
    },
    {
      "project_name": "Changning District Integrated Management Big Screen",
      "project_role": "Core Developer", 
      "project_time": "Mar 2020 - Jun 2022",
      "project_desc": "Smart city big screen project developed based on React and ArcGIS frameworks for multi-departmental data access and display for client. Includes map-based high frequency data display of various types and multimedia data visualization.",
      "project_content": "Initially responsible for developing multiple map display components and pages based on ArcGIS. Later took over as project lead, drove planning, code refactoring, design optimization, and data logic improvements. Handled normalization of multi-departmental data into geographic coordinate system through batch processing and conversion tools, streamlining workflows. Developed aggregation, selection, polygon selection and other functions. Deeply customized ArcGISJS map framework to implement high performance spatial point aggregation plugin for real-time aggregation of massive data volumes (100,000+). Solved browser memory overflow issues for long-running big screen display, enabling 24/7 stability."
    }
  ],
  "workList": [],
  "aboutme": {
    "aboutme_desc": "Proficient in modern web graphics technologies. Understands Three.js source code and implementations. Also has independent open source WebGL rendering engine project experience demonstrating solid graphics math foundations and engineering skills. Has certain theoretical knowledge and engineering experience related to web graphics, animations, particles, performance optimization, memory management. Has experience with WebGL, OpenGL and other graphics APIs and GLSL/shader languages. Can implement various common effects or write performant hardware accelerated particles/animations. Understands modern rendering pipelines and follows cutting edge graphics technologies with certain comprehension and implementation capabilities.\nProficient with HTML, CSS, JavaScript, TypeScript and other front-end technologies. Has good algorithms and native JS foundations. Also familiar with front-end project development through React, Redux/DVA. Can quickly build front-end pages and implement features based on design drafts. Proficient with canvas, pixi.js, echarts and other visualization and effects components. Has certain aesthetics and design capabilities, and can provide optimized development solutions based on design needs. Pays attention to details of visualization effects. Actively promotes front-end engineering and automation. Familiar with common Webpack configs and creating npm scaffolds. Experienced with git version control, Linux, and some Python, Node.js, C++, Godot engine development experience."
  },
  "theme": { 
    "color": "#2f5785",
    "tagColor": "#8bc34a"
  }
}
